app/views/profiles/show.html.erb

                  <%= pluralize(post.likes_count, 'like') %> •
                  <%= pluralize(post.comments.count, 'comment') %> •
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 6