app/views/users/show.html.erb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 3 LIMIT 1
---
        <h4><%= @user.username %></h4>
        <% if @user.profile&.bio.present? %>

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 3 ORDER BY "posts"."created_at" DESC
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = 3
---
        <p class="text-muted">
          <%= pluralize(@user.posts.count, 'post') %> written

SELECT "users".* FROM "users" WHERE "users"."username" = 'alihasanyzc' LIMIT 1
---
  <div class="col-md-8">
    <h3><%= @user.username %>'s Posts (<%= @posts.count %>)</h3>

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 1
---
                  <%= pluralize(post.likes_count, 'like') %> •
                  <%= pluralize(post.comments.count, 'comment') %> •