app/views/posts/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 1
---
                  <%= pluralize(post.likes_count, 'like') %> •
                  <%= pluralize(post.comments.count, 'comment') %> •