app/views/posts/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 3 LIMIT 1
---
        <h6><%= @post.user.username %></h6>
        <% if @post.user.profile&.bio.present? %>

SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = 3
---
        <p class="text-muted">
          <%= pluralize(@post.user.posts.count, 'post') %> written