app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = 2 LIMIT 1
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = 1
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = 2 ORDER BY "posts"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
  def show
    @category = Category.find(params[:id])
    @posts = @category.posts.recent.includes(:user, :likes)