app/controllers/comments_controller.rb

  def create
    @comment = @post.comments.build(comment_params)
    @comment.user = current_user

    if @comment.save
---
INSERT INTO "comments" ("body", "post_id", "user_id", "created_at", "updated_at") VALUES ('yorum var', 1, 3, '2025-07-07 08:51:02.406264', '2025-07-07 08:51:02.406264') RETURNING "id"

  def destroy
    if @comment.user == current_user
      @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = 2