app/controllers/posts_controller.rb

  def index
    @posts = Post.recent.includes(:user, :category, :likes)
    @categories = Category.all

    if params[:category_id].present?
      @posts = @posts.where(category_id: params[:category_id])
      @selected_category = Category.find(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (3, 2)
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" IN (2, 1)
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = 2 ORDER BY "posts"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (5, 3)
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 1 LIMIT 1

  def show
    @comment = Comment.new
    @comments = @post.comments.recent.includes(:user)
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1 ORDER BY "comments"."created_at" DESC

  def new
    @post = current_user.posts.build
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @post = current_user.posts.build(post_params)

    if @post.save
      flash[:notice] = "Post created successfully!"
      redirect_to @post
    else
      @categories = Category.all
---
INSERT INTO "posts" ("title", "body", "category_id", "user_id", "created_at", "updated_at") VALUES ('kkkkkkkk', 'içerikkkkkkkkkkkkkkkkkkkkkk', 2, 3, '2025-07-07 08:50:54.188319', '2025-07-07 08:50:54.188319') RETURNING "id"
SELECT "categories".* FROM "categories"

  def edit
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def update
    if @post.update(post_params)
      flash[:notice] = "Post updated successfully!"
      redirect_to @post
    else
      @categories = Category.all
---
UPDATE "posts" SET "body" = 'knıuhıuhıuhıudhıuhdfıuhıufıwejrıef', "updated_at" = '2025-07-07 13:20:14.155044' WHERE "posts"."id" = 5
SELECT "categories".* FROM "categories"

  def like
    @like = @post.likes.find_by(user: current_user)

    if @like
      @like.update(liked: true)
    else
      @post.likes.create(user: current_user, liked: true)
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = 2 AND "likes"."user_id" = 3 LIMIT 1
UPDATE "likes" SET "liked" = TRUE, "updated_at" = '2025-07-07 08:55:22.884205' WHERE "likes"."id" = 1
INSERT INTO "likes" ("post_id", "user_id", "liked", "created_at", "updated_at") VALUES (2, 3, TRUE, '2025-07-07 08:55:20.440251', '2025-07-07 08:55:20.440251') RETURNING "id"

  def unlike
    @like = @post.likes.find_by(user: current_user)
    @like&.update(liked: false)
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = 2 AND "likes"."user_id" = 3 LIMIT 1
UPDATE "likes" SET "liked" = FALSE, "updated_at" = '2025-07-07 08:55:22.315189' WHERE "likes"."id" = 1