app/controllers/profiles_controller.rb

  def show
    @profile = current_user.profile || current_user.create_profile
    @posts = current_user.posts.recent.includes(:category, :likes)
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" IN (3, 1)
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 3 ORDER BY "posts"."created_at" DESC
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 3 LIMIT 1

  def update
    @profile = current_user.profile || current_user.create_profile

    if @profile.update(profile_params)
---
UPDATE "profiles" SET "bio" = 'benim hakkımda şu ', "avatar" = 'https://avatars.dicebear.com/api/bottts/sabit-avatar.svg', "updated_at" = '2025-07-07 11:38:12.958404' WHERE "profiles"."id" = 3