app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "username", "created_at", "updated_at") VALUES ('alihasanyazici28@gmail.com', '$2a$12$.lithpi1UKkG01IC/Ruw1OXPfXUNSXWmTPLC8g37SkgP7D9gC60CS', 'alihasanyzc', '2025-07-07 08:50:19.497343', '2025-07-07 08:50:19.497343') RETURNING "id"
INSERT INTO "profiles" ("user_id", "bio", "avatar", "created_at", "updated_at") VALUES (3, NULL, NULL, '2025-07-07 08:50:19.556634', '2025-07-07 08:50:19.556634') RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save
      # Create profile for the user
      @user.create_profile

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (3, 2)
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" IN (2, 1)
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 3 ORDER BY "posts"."created_at" DESC
---
  def show
    @posts = @user.posts.recent.includes(:category, :likes)

SELECT "users".* FROM "users" WHERE "users"."username" = 'alihasanyzc' LIMIT 1
---
  def set_user
    @user = User.find_by(username: params[:username])