app/views/categories/index.html.erb

SELECT COUNT(*) FROM "posts" WHERE "posts"."category_id" = 1
---
              <p class="card-text">
                <%= pluralize(category.posts.count, 'post') %>